---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
source: html/fc038108-6279-839c-285b-effe342b4491.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular

Defines common set of parameters for structural section rectangular contour.

## Syntax (C#)
```csharp
public class StructuralSectionRectangular : StructuralSection
```